Repository: yelmuratoff/ispect
Catalog: packages/ispect/lib/src/core/localization/translations/intl_*.arb
Languages: ar, de, es, fr, hi, ja, kk, ko, pt, ru, zh

# jiraInstruction
source: 1. Go to your Jira website. 2. Click on your Profile avatar in the bottom left corner. 3. Click on Profile. 4. Click Manage your account. 5. Select Security. 6. Scroll down to Create and manage API tokens and click on it. 7. Create a token, then copy and paste it.
ar: 1. اذهب إلى موقع Jira الخاص بك. 2. انقر على صورة ملفك الشخصي في الزاوية السفلية اليسرى. 3. انقر على الملف الشخصي. 4. انقر على إدارة حسابك. 5. اختر الأمان. 6. قم بالتمرير لأسفل إلى إنشاء وإدارة رموز API وانقر عليه. 7. أنشئ رمزًا، ثم انسخه والصقه.
de: 1. Gehen Sie auf Ihre Jira-Website. 2. Klicken Sie auf Ihr Profil-Avatar in der unteren linken Ecke. 3. Klicken Sie auf Profil. 4. Klicken Sie auf Ihr Konto verwalten. 5. Wählen Sie Sicherheit. 6. Scrollen Sie nach unten zu API-Token erstellen und verwalten und klicken Sie darauf. 7. Erstellen Sie ein Token, dann kopieren und fügen Sie es ein.
es: 1. Ve al sitio web de Jira. 2. Haz clic en tu avatar de perfil en la esquina inferior izquierda. 3. Haz clic en Perfil. 4. Haz clic en Administrar tu cuenta. 5. Selecciona Seguridad. 6. Desplázate hacia abajo hasta Crear y gestionar tokens de API y haz clic en ello. 7. Crea un token, luego cópialo y pégalo.
fr: 1. Rendez-vous sur votre site Jira. 2. Cliquez sur votre avatar de profil dans le coin inférieur gauche. 3. Cliquez sur Profil. 4. Cliquez sur Gérer votre compte. 5. Sélectionnez Sécurité. 6. Faites défiler jusqu'à Créer et gérer des jetons API et cliquez dessus. 7. Créez un jeton, puis copiez-le et collez-le.
hi: 1. अपनी Jira वेबसाइट पर जाएँ। 2. निचले बाएँ कोने में अपने प्रोफाइल अवतार पर क्लिक करें। 3. प्रोफाइल पर क्लिक करें। 4. अपने खाते का प्रबंधन करें पर क्लिक करें। 5. सुरक्षा चुनें। 6. API टोकन बनाएँ और प्रबंधित करें तक स्क्रॉल करें और उस पर क्लिक करें। 7. एक टोकन बनाएँ, फिर उसे कॉपी और पेस्ट करें।
ja: 1. Jiraウェブサイトにアクセスしてください。 2. 左下のプロフィールアバターをクリックしてください。 3. プロフィールをクリックしてください。 4. アカウントの管理をクリックしてください。 5. セキュリティを選択してください。 6. APIトークンの作成と管理までスクロールしてクリックしてください。 7. トークンを作成し、コピーして貼り付けてください。
kk: 1. JIRA веб-сайтына өтіңіз. 2. Төменгі сол жақтағы профиль Аватарын түртіңіз. 3. Профильді басыңыз. 4. Тіркелгіні басқару түймесін басыңыз. 5. Қауіпсіздікті Таңдаңыз. 6. API таңбалауыштарын жасау және басқару бөліміне төмен жылжып, оны басыңыз. 7. Токен жасаңыз, содан кейін оны көшіріп, қойыңыз.
ko: 1. Jira 웹사이트로 이동하세요. 2. 좌측 하단의 프로필 아바타를 클릭하세요. 3. 프로필을 클릭하세요. 4. 계정 관리를 클릭하세요. 5. 보안을 선택하세요. 6. API 토큰 생성 및 관리로 스크롤한 후 클릭하세요. 7. 토큰을 생성한 다음 복사하여 붙여넣으세요.
pt: 1. Acesse o site do Jira. 2. Clique no seu avatar de perfil no canto inferior esquerdo. 3. Clique em Perfil. 4. Clique em Gerenciar sua conta. 5. Selecione Segurança. 6. Role para baixo até Criar e gerenciar tokens de API e clique nisso. 7. Crie um token, depois copie e cole-o.
ru: 1. Зайдите на свой сайт Jira. 2. Нажмите на аватар вашего профиля в левом нижнем углу. 3. Нажмите на Профиль. 4. Нажмите Управление учетной записью. 5. Выберите Безопасность. 6. Прокрутите вниз до раздела Создание и управление API-токенами и нажмите на него. 7. Создайте токен, затем скопируйте и вставьте его.
zh: 1. 访问你的 Jira 网站。 2. 点击左下角的个人头像。 3. 选择“个人资料”。 4. 点击“管理你的账户”。 5. 选择“安全性”。 6. 滚动至“创建和管理 API 令牌”并点击。 7. 创建令牌，然后复制并粘贴。

# logItemCopied
source: Log item is copied in clipboard
ar: تم نسخ عنصر السجل في الحافظة
de: Protokollelement in die Zwischenablage kopiert
es: Elemento de registro copiado al portapapeles
fr: Élément de journal copié dans le presse-papiers
hi: लॉग आइटम क्लिपबोर्ड में कॉपी किया गया
ja: ログ項目がクリップボードにコピーされました
kk: Жазба алмасу буферіне көшірілді
ko: 로그 항목이 클립보드에 복사됨
pt: Item de log copiado para a área de transferência
ru: Запись скопирована в буфер обмена
zh: 日志项已复制到剪贴板

source: Login
ar: تسجيل الدخول
de: Anmelden
es: Iniciar sesión
fr: Connexion
hi: लॉगिन
ja: ログイン
kk: Кіру
ko: 로그인
pt: Entrar
ru: Вход
zh: 登录

source: Log Out
ar: تسجيل الخروج
de: Abmelden
es: Cerrar sesión
fr: Déconnexion
hi: लॉगआउट
ja: ログアウト
kk: Шығу
ko: 로그아웃
pt: Sair
ru: Выйти
zh: 登出

source: Logs count
ar: عدد السجلات
de: Anzahl der Protokolle
es: Cantidad de registros
fr: Nombre de journaux
hi: लॉग गणना
ja: ログ数
kk: Жазбалар саны
ko: 로그 수
pt: Contagem de logs
ru: Количество записей
zh: 日志数量

source: Method
ar: الطريقة
de: Methode
es: Método
fr: Méthode
hi: विधि
ja: メソッド
kk: Әдіс
ko: 방법
pt: Método
ru: Метод
zh: 方法

source: Navigate
ar: التنقل
de: Navigieren
es: Navegar
fr: Naviguer
hi: नेविगेट करें
ja: ナビゲート
kk: Навигация
ko: 탐색
pt: Navegar
ru: Навигация
zh: 导航

source: Navigation Flow
ar: تدفق التنقل
de: Navigationsfluss
es: Flujo de navegación
hi: नेविगेशन फ्लो
ja: ナビゲーションフロー
kk: Навигация ағыны
pt: Fluxo de navegação
ru: Flow навигации
zh: 导航流程

# noNavigationTransitions
source: No navigation transitions recorded
ar: لم يتم تسجيل أي انتقالات تنقل
de: Keine Navigationstransitionen aufgezeichnet
es: No se registraron transiciones de navegación
hi: कोई नेविगेशन ट्रांजिशन रिकॉर्ड नहीं किया गया
ja: ナビゲーションの遷移は記録されていません
kk: Навигациялық ауысулар тіркелмеген
pt: Nenhuma transição de navegação registrada
ru: Переходы навигации не зафиксированы
zh: 未记录导航转换

source: Current
ar: الحالي
de: Aktuell
es: Actual
hi: वर्तमान
ja: 現在
kk: Ағымдағы
pt: Atual
ru: Текущий
zh: 当前

source: Start
ar: البداية
es: Inicio
hi: प्रारंभ
ja: 開始
kk: Бастау
pt: Início
ru: Начало
zh: 开始

source: Selected Transition
ar: الانتقال المحدد
de: Ausgewählter Übergang
es: Transición seleccionada
hi: चयनित ट्रांजिशन
ja: 選択された遷移
kk: Таңдалған ауысу
pt: Transição selecionada
ru: Выбранный переход
zh: 已选转换

source: not found
ar: غير موجود
de: Nicht gefunden
es: No encontrado
fr: Non trouvé
hi: नहीं मिला
ja: 見つかりません
kk: табылған жоқ
ko: 찾을 수 없음
pt: Não encontrado
ru: не найдена
zh: 未找到

# otherLogsForDevelopers
source: Other logs are already being used by developers
ar: السجلات الأخرى تُستخدم بالفعل من قِبل المطورين
de: Andere Protokolle werden bereits von Entwicklern verwendet
es: Otros registros ya están siendo usados por desarrolladores
fr: D'autres journaux sont déjà utilisés par les développeurs
hi: अन्य लॉग पहले से ही डेवलपर्स द्वारा उपयोग में हैं
ja: 他のログはすでに開発者によって使用されています
ko: 다른 로그는 이미 개발자가 사용 중임
pt: Outros logs já estão sendo usados por desenvolvedores
ru: Другие логи уже используют разработчики
zh: 其他日志已供开发者使用

# pageNotFound
source: Oops, the page on this path
ar: عفوًا، الصفحة على هذا المسار
de: Oops, die Seite auf diesem Pfad
es: Oops, la página en esta ruta
fr: Oups, la page sur ce chemin
hi: ओह, इस पथ पर पेज
ja: おっと、このパスにページがありません
kk: Ой, бұл жолдағы бет
ko: 이 경로의 페이지를 찾을 수 없습니다
pt: Ops, a página neste caminho
ru: Ой, страница по этому пути
zh: 哎呀，该路径上的页面不存在

source: Path
ar: المسار
de: Pfad
es: Ruta
fr: Chemin
hi: पथ
ja: パス
kk: Жол
ko: 경로
pt: Caminho
ru: Путь
zh: 路径

# performanceTracker
source: Performance tracking
ar: تتبع الأداء
de: Leistungsverfolgung
es: Seguimiento de rendimiento
fr: Suivi des performances
hi: प्रदर्शन ट्रैकिंग
ja: パフォーマンス追跡
kk: Өнімділікті қадағалау
ko: 성능 추적
pt: Rastreamento de desempenho
ru: Отслеживание производительности
zh: 性能跟踪

source: Picked images
ar: الصور المختارة
de: Ausgewählte Bilder
es: Imágenes seleccionadas
fr: Images sélectionnées
hi: चयनित छवियाँ
ja: 選択した画像
kk: Таңдалған суреттер
ko: 선택된 이미지
pt: Imagens selecionadas
ru: Выбранные изображения
zh: 已选图片

# pleaseAuthToJira
source: Please authorize to Jira
ar: يرجى التفويض في Jira
de: Bitte autorisieren Sie sich bei Jira
es: Por favor, autoriza en Jira
fr: Veuillez vous authentifier sur Jira
hi: कृपया Jira में प्रमाणित करें
ja: Jiraで認証してください
kk: Jira-ға кіруіңізді беруіңізді өтінемін
ko: Jira에 인증해 주세요
pt: Por favor, autorize no Jira
ru: Пожалуйста, авторизуйтесь в Jira
zh: 请授权 Jira

# pleaseCheckAuthCred
source: An error has occurred. Please check the authorization data.
ar: حدث خطأ. يرجى التحقق من بيانات التفويض.
de: Ein Fehler ist aufgetreten. Bitte überprüfen Sie die Autorisierungsdaten.
es: Ha ocurrido un error. Por favor, verifica los datos de autorización.
fr: Une erreur s'est produite. Veuillez vérifier les données d'authentification.
hi: एक त्रुटि हुई है। कृपया प्रमाणीकरण डेटा जांचें।
ja: エラーが発生しました。認証データを確認してください。
kk: Қате. Авторизация деректерін тексеріп көріңіз.
ko: 오류가 발생했습니다. 인증 데이터를 확인해 주세요.
pt: Ocorreu um erro. Por favor, verifique os dados de autorização.
ru: Произошла ошибка. Пожалуйста, проверьте данные авторизации.
zh: 发生错误，请检查授权信息。

# pleaseSelectYourProject
source: Now, please select a project
ar: الآن، يرجى اختيار مشروع
de: Bitte wählen Sie jetzt ein Projekt aus
es: Ahora, por favor, selecciona un proyecto
fr: Maintenant, veuillez sélectionner un projet
hi: अब, कृपया एक प्रोजेक्ट चुनें
ja: プロジェクトを選択してください
kk: Енді жобаны таңдаңыз
ko: 이제 프로젝트를 선택해 주세요
pt: Agora, por favor, selecione um projeto
ru: Теперь, пожалуйста, выберите проект
zh: 现在，请选择一个项目

# printLogDesc
source: Message printed to console
ar: سجل طريقة الطباعة القياسية في Flutter
de: Das Protokoll der standardmäßigen Druckmethode in Flutter
es: Registro del método de impresión estándar en Flutter
fr: Journal de la méthode d'impression standard dans Flutter
hi: Flutter में मानक प्रिंट विधि का लॉग
ja: Flutterの標準印刷メソッドのログ
kk: Flutter стандартты print методоның журналы
ko: Flutter의 표준 출력 메서드 로그
pt: O log do método de impressão padrão no Flutter
ru: Сообщение выведено в консоль
zh: Flutter 标准 print 方法的日志

source: Project domain
ar: نطاق المشروع
de: Projektdomäne
es: Dominio del proyecto
fr: Domaine du projet
hi: प्रोजेक्ट डोमेन
ja: プロジェクトドメイン
kk: Жоба домені
ko: 프로젝트 도메인
pt: Domínio do projeto
ru: Домен проекта
zh: 项目域

source: Project was selected
ar: تم اختيار المشروع
de: Projekt wurde ausgewählt
es: Proyecto seleccionado
fr: Projet sélectionné
hi: प्रोजेक्ट चुना गया
ja: プロジェクトが選択されました
kk: Жоба таңдалды
ko: 프로젝트가 선택됨
pt: Projeto foi selecionado
ru: Проект выбран
zh: 项目已选定

source: Request headers
ar: رؤوس الطلب
de: Anfrage-Header
es: Encabezados de solicitud
fr: En-têtes de requête
hi: अनुरोध हेडर
ja: リクエストヘッダー
kk: Запростың headers-і
ko: 요청 헤더
pt: Cabeçalhos de solicitação
ru: Headers запроса
zh: 请求头

source: Retry
ar: إعادة المحاولة
de: Wiederholen
es: Reintentar
fr: Réessayer
hi: पुनः प्रयास करें
ja: 再試行
kk: Қайталау
ko: 재시도
pt: Tentar novamente
ru: Повторить
zh: 重试

source: Reverse logs
ar: عكس السجلات
de: Protokolle umkehren
es: Invertir registros
fr: Inverser les journaux
hi: लॉग उलटें
ja: ログを反転
kk: Журналды кері бұру
ko: 로그 뒤집기
pt: Inverter logs
ru: Обратный порядок журнала
zh: 反转日志

# riverpodAddLogDesc
source: Data provider created
ar: سجل إضافة المزود
de: Protokoll der Provider-Hinzufügung
es: Registro de adición de proveedor
fr: Journal d'ajout de fournisseur
hi: प्रोवाइडर जोड़ने का लॉग
ja: プロバイダー追加ログ
kk: Провайдер қосу журналы
ko: 프로바이더 추가 로그
pt: Log de adição de provedor
ru: Провайдер данных создан
zh: Provider 添加日志

# riverpodDisposeLogDesc
source: Data provider removed
ar: سجل التخلص من المزود
de: Protokoll der Provider-Entsorgung
es: Registro de eliminación de proveedor
fr: Journal de suppression de fournisseur
hi: प्रोवाइडर निपटान का लॉग
ja: プロバイダー破棄ログ
kk: Провайдерді жою журналы
ko: 프로바이더 폐기 로그
pt: Log de descarte de provedor
ru: Провайдер данных удалён
zh: Provider 释放日志

# riverpodFailLogDesc
source: Data provider encountered an error
ar: سجل خطأ المزود
de: Protokoll des Provider-Fehlers
es: Registro de error de proveedor
fr: Journal d'erreur de fournisseur
hi: प्रोवाइडर त्रुटि का लॉग
ja: プロバイダーエラーログ
kk: Провайдермен жұмыс істеу қатесі журналы
ko: 프로바이더 오류 로그
pt: Log de erro de provedor
ru: Провайдер данных столкнулся с ошибкой
zh: Provider 错误日志

# riverpodUpdateLogDesc
source: Data provider updated
ar: سجل تحديث المزود
de: Protokoll der Provider-Aktualisierung
es: Registro de actualización de proveedor
fr: Journal de mise à jour de fournisseur
hi: प्रोवाइडर अपडेट का लॉग
ja: プロバイダー更新ログ
kk: Провайдерді жаңарту журналы
ko: 프로바이더 업데이트 로그
pt: Log de atualização de provedor
ru: Провайдер данных обновлён
zh: Provider 更新日志

# routeLogDesc
source: Navigated to a different screen
ar: سجل التنقل بين الشاشات
de: Bildschirmnavigationsprotokoll
es: Registro de navegación de pantalla
fr: Journal de navigation d'écran
hi: स्क्रीन नेविगेशन लॉग
ja: 画面ナビゲーションログ
kk: Экрандар арасындағы навигация журналы
ko: 화면 탐색 로그
pt: Log de navegação de tela
ru: Выполнен переход на другой экран
zh: 页面导航日志

source: Search
ar: بحث
de: Suchen
es: Buscar
fr: Rechercher
hi: खोज
ja: 検索
kk: Іздеу
ko: 검색
pt: Pesquisar
ru: Поиск
zh: 搜索

source: Select assignee
ar: اختر المُكلف
de: Zuständigen auswählen
es: Seleccionar asignado
fr: Sélectionner un assigné
hi: असाइनी चुनें
ja: 担当者を選択
kk: Орындаушыны таңдау
ko: 담당자 선택
pt: Selecionar responsável
ru: Выбрать исполнителя
zh: 选择负责人

source: Select board
ar: اختر اللوحة
de: Board auswählen
es: Seleccionar tablero
fr: Sélectionner un tableau
hi: बोर्ड चुनें
ja: ボードを選択
kk: Тақтаны таңдау
ko: 보드 선택
pt: Selecionar quadro
ru: Выбрать доску
zh: 选择看板

source: Select issue type
ar: اختر نوع المشكلة
de: Problemtyp auswählen
es: Seleccionar tipo de problema
fr: Sélectionner un type de problème
hi: मुद्दे का प्रकार चुनें
ja: 問題タイプを選択
kk: Мәселе түрін таңдау
ko: 문제 유형 선택
pt: Selecionar tipo de problema
ru: Выбрать тип задачи
zh: 选择问题类型

source: Select label
ar: اختر التسمية
de: Label auswählen
es: Seleccionar etiqueta
fr: Sélectionner une étiquette
hi: लेबल चुनें
ja: ラベルを選択
kk: Белгіні таңдау
ko: 라벨 선택
pt: Selecionar rótulo
ru: Выбрать метку
zh: 选择标签

source: Select priority
ar: اختر الأولوية
de: Priorität auswählen
es: Seleccionar prioridad
fr: Sélectionner une priorité
hi: प्राथमिकता चुनें
ja: 優先度を選択
kk: Мәселенің басымдығын таңдаңыз
ko: 우선순위 선택
pt: Selecionar prioridade
ru: Выберите приоритетность задачи
zh: 选择优先级

source: Select sprint
ar: اختر السباق
de: Sprint auswählen
es: Seleccionar sprint
fr: Sélectionner un sprint
hi: स्प्रिंट चुनें
ja: スプリントを選択
kk: Спринтты таңдау
ko: 스프린트 선택
pt: Selecionar sprint
ru: Выбрать спринт
zh: 选择冲刺

source: Select status
ar: اختر الحالة
de: Status auswählen
es: Seleccionar estado
fr: Sélectionner un statut
hi: स्थिति चुनें
ja: ステータスを選択
kk: Мәртебені таңдау
ko: 상태 선택
pt: Selecionar status
ru: Выбрать статус
zh: 选择状态

source: Send issue
ar: إرسال المشكلة
de: Problem senden
es: Enviar problema
fr: Envoyer le problème
hi: मुद्दा भेजें
ja: 問題を送信
kk: Мәселені жіберу
ko: 문제 보내기
pt: Enviar problema
ru: Отправить задачу
zh: 发送问题

source: Settings
ar: الإعدادات
de: Einstellungen
es: Configuraciones
fr: Paramètres
hi: सेटिंग्स
ja: 設定
kk: Баптаулар
ko: 설정
pt: Configurações
ru: Настройки
zh: 设置

source: Share
ar: مشاركة
de: Teilen
es: Compartir
fr: Partager
hi: साझा करें
ja: 共有
kk: Бөлісу
ko: 공유
pt: Compartilhar
ru: Поделиться
zh: 分享

source: Share logs file
ar: مشاركة ملف السجلات
de: Protokolldatei teilen
es: Compartir archivo de registros
fr: Partager le fichier des journaux
hi: लॉग फ़ाइल साझा करें
ja: ログファイルを共有
kk: Журнал файлын бөлісу
ko: 로그 파일 공유
pt: Compartilhar arquivo de logs
ru: Поделиться файлом журнала
zh: 分享日志文件

source: Status code
ar: رمز الحالة
es: Código de estado
fr: Code de statut
hi: स्थिति कोड
ja: ステータスコード
kk: Статус коды
ko: 상태 코드
pt: Código de status
ru: Код статуса
zh: 状态码

source: Status message
ar: رسالة الحالة
de: Statusmeldung
es: Mensaje de estado
fr: Message de statut
hi: स्थिति संदेश
ja: ステータスメッセージ
kk: Cтатус
ko: 상태 메시지
pt: Mensagem de status
ru: Cтатус
zh: 状态消息

# submitButtonText
source: Submit
ar: إرسال
de: Absenden
es: Enviar
fr: Soumettre
hi: जमा करें
ja: 送信
kk: Жіберу
ko: 제출
pt: Enviar
ru: Отправить
zh: 提交

# successfullyAuthorized
source: You have successfully logged in
ar: لقد سجلت الدخول بنجاح
de: Sie haben sich erfolgreich angemeldet
es: Has iniciado sesión con éxito
fr: Vous vous êtes connecté avec succès
hi: आपने सफलतापूर्वक लॉगिन किया है
ja: ログインに成功しました
kk: Сіз сәтті кірдіңіз
ko: 성공적으로 로그인했습니다
pt: Você fez login com sucesso
ru: Вы успешно авторизовались
zh: 您已成功登录

source: Summary
ar: ملخص
de: Zusammenfassung
es: Resumen
fr: Résumé
hi: सारांश
ja: 概要
kk: Қысқаша мазмұн
ko: 요약
pt: Resumo
ru: Сводка
zh: 摘要

# iSpectifyBlocClosesCount
source: BLoC closes count: {text}
ar: عدد إغلاقات BLoC: {text}
de: Anzahl der BLoC-Schließungen: {text}
es: Cantidad de cierres de BLoC: {text}
fr: Nombre de fermetures de BLoC : {text}
hi: BLoC बंद होने की संख्या: {text}
ja: BLoC終了回数: {text}
ko: BLoC 종료 횟수: {text}
pt: Contagem de fechamentos de BLoC: {text}
ru: Количество закрытий BLoC: {text}
zh: BLoC 关闭次数: {text}

# iSpectifyBlocCreatesCount
source: BLoC creates count: {text}
ar: عدد إنشاءات BLoC: {text}
de: Anzahl der BLoC-Erstellungen: {text}
es: Cantidad de creaciones de BLoC: {text}
fr: Nombre de créations de BLoC : {text}
hi: BLoC बनने की संख्या: {text}
ja: BLoC作成回数: {text}
ko: BLoC 생성 횟수: {text}
pt: Contagem de criações de BLoC: {text}
ru: Количество созданий BLoC: {text}
zh: BLoC 创建次数: {text}

# iSpectifyBlocEventsCount
source: BLoC events count: {text}
ar: عدد أحداث BLoC: {text}
de: Anzahl der BLoC-Ereignisse: {text}
es: Cantidad de eventos de BLoC: {text}
fr: Nombre d'événements de BLoC : {text}
hi: BLoC ईवेंट की संख्या: {text}
ja: BLoCイベント回数: {text}
kk: BLoC оқиғаларының саны: {text}
ko: BLoC 이벤트 횟수: {text}
pt: Contagem de eventos de BLoC: {text}
ru: Количество событий BLoC: {text}
zh: BLoC 事件次数: {text}

# iSpectifyBlocTransitionCount
source: BLoC transitions count: {text}
ar: عدد انتقالات BLoC: {text}
de: Anzahl der BLoC-Übergänge: {text}
es: Cantidad de transiciones de BLoC: {text}
fr: Nombre de transitions de BLoC : {text}
hi: BLoC परिवर्तन की संख्या: {text}
ja: BLoC遷移回数: {text}
kk: BLoC өтпеліктерінің саны: {text}
ko: BLoC 전환 횟수: {text}
pt: Contagem de transições de BLoC: {text}
ru: Количество переходов BLoC: {text}
zh: BLoC 转换次数: {text}

# iSpectifyHttpFailuresCount
source: HTTP failure logs count: {text}
ar: عدد سجلات فشل HTTP: {text}
de: Anzahl der HTTP-Fehlerprotokolle: {text}
es: Cantidad de registros de fallos HTTP: {text}
fr: Nombre de journaux d'échecs HTTP : {text}
hi: HTTP विफलता लॉग की संख्या: {text}
ja: HTTP失敗ログ数: {text}
kk: Сәтсіз HTTP сұраныстары жазбаларының саны: {text}
ko: HTTP 실패 로그 수: {text}
pt: Contagem de logs de falhas HTTP: {text}
ru: Количество записей неудачных HTTP запросов: {text}
zh: HTTP 失败日志数: {text}

# iSpectifyHttpRequestsCount
source: HTTP request logs count: {text}
ar: عدد سجلات طلبات HTTP: {text}
de: Anzahl der HTTP-Anfrageprotokolle: {text}
es: Cantidad de registros de solicitudes HTTP: {text}
fr: Nombre de journaux de requêtes HTTP : {text}
hi: HTTP अनुरोध लॉग की संख्या: {text}
ja: HTTPリクエストログ数: {text}
kk: HTTP сұраныстарының саны: {text}
ko: HTTP 요청 로그 수: {text}
pt: Contagem de logs de solicitações HTTP: {text}
ru: Количество записей HTTP запросов: {text}
zh: HTTP 请求日志数: {text}

# iSpectifyHttpResponsesCount
source: HTTP response logs count: {text}
ar: عدد سجلات استجابات HTTP: {text}
de: Anzahl der HTTP-Antwortprotokolle: {text}
es: Cantidad de registros de respuestas HTTP: {text}
fr: Nombre de journaux de réponses HTTP : {text}
hi: HTTP प्रतिक्रिया लॉग की संख्या: {text}
ja: HTTPレスポンスログ数: {text}
kk: HTTP жауаптары жазбаларының саны: {text}
ko: HTTP 응답 로그 수: {text}
pt: Contagem de logs de respostas HTTP: {text}
ru: Количество записей HTTP ответов: {text}
zh: HTTP 响应日志数: {text}

# iSpectifyLogsInfo
source: Info about logs
ar: معلومات حول السجلات
de: Informationen über Protokolle
es: Información sobre registros
fr: Informations sur les journaux
hi: लॉग के बारे में जानकारी
ja: ログ情報
kk: Жазба бойынша ақпарат
ko: 로그 정보
pt: Informações sobre logs
ru: Информация про логи
zh: 日志信息

# iSpectifyRiverpodAddCount
source: Riverpod adds count: {text}
ar: عدد إضافات Riverpod: {text}
de: Anzahl der Riverpod-Hinzufügungen: {text}
es: Cantidad de adiciones de Riverpod: {text}
fr: Nombre d'ajouts Riverpod : {text}
hi: Riverpod जोड़ने की संख्या: {text}
ja: Riverpod追加回数: {text}
kk: Riverpod қосуларының саны: {text}
ko: Riverpod 추가 횟수: {text}
pt: Contagem de adições de Riverpod: {text}
ru: Количество добавлений Riverpod: {text}
zh: Riverpod 添加次数: {text}

# iSpectifyRiverpodDisposeCount
source: Riverpod disposes count: {text}
ar: عدد التخلص من Riverpod: {text}
de: Anzahl der Riverpod-Entsorgungen: {text}
es: Cantidad de eliminaciones de Riverpod: {text}
fr: Nombre de suppressions Riverpod : {text}
hi: Riverpod निपटान की संख्या: {text}
ja: Riverpod破棄回数: {text}
kk: Riverpod жабулар саны: {text}
ko: Riverpod 폐기 횟수: {text}
pt: Contagem de descartes de Riverpod: {text}
ru: Количество закрытий Riverpod: {text}
zh: Riverpod 销毁次数: {text}

# iSpectifyRiverpodFailsCount
source: Riverpod fails count: {text}
ar: عدد فشل Riverpod: {text}
de: Anzahl der Riverpod-Fehler: {text}
es: Cantidad de fallos de Riverpod: {text}
fr: Nombre d'échecs Riverpod : {text}
hi: Riverpod विफलता की संख्या: {text}
ja: Riverpod失敗回数: {text}
kk: Riverpod қателер саны: {text}
ko: Riverpod 실패 횟수: {text}
pt: Contagem de falhas de Riverpod: {text}
ru: Количество ошибок Riverpod: {text}
zh: Riverpod 失败次数: {text}

# iSpectifyRiverpodUpdateCount
source: Riverpod updates count: {text}
ar: عدد تحديثات Riverpod: {text}
de: Anzahl der Riverpod-Aktualisierungen: {text}
es: Cantidad de actualizaciones de Riverpod: {text}
fr: Nombre de mises à jour Riverpod : {text}
hi: Riverpod अपडेट की संख्या: {text}
ja: Riverpod更新回数: {text}
kk: Riverpod жаңартуларының саны: {text}
ko: Riverpod 업데이트 횟수: {text}
pt: Contagem de atualizações de Riverpod: {text}
ru: Количество обновлений Riverpod: {text}
zh: Riverpod 更新次数: {text}

# iSpectifyTypeAnalytics
source: Event logging method
ar: طريقة تسجيل الأحداث
de: Methode zum Protokollieren von Ereignissen
es: Método de registro de eventos
fr: Méthode d'enregistrement d'événements
hi: ईवेंट लॉगिंग विधि
ja: イベントロギング方法
kk: Іс-шараны тіркеу әдісі
ko: 이벤트 로깅 방법
pt: Método de registro de eventos
ru: Метод логирования ивента
zh: 事件日志方法

# iSpectifyTypeAnalyticsCount
source: Number of track logs: {text}
ar: عدد سجلات التتبع: {text}
de: Anzahl der Tracking-Protokolle: {text}
es: Número de registros de seguimiento: {text}
fr: Nombre de journaux de suivi : {text}
hi: ट्रैकिंग लॉग की संख्या: {text}
ja: トラッキングログ数: {text}
kk: Track жазбаларының саны: {text}
ko: 추적 로그 수: {text}
pt: Número de logs de rastreamento: {text}
ru: Количество track записей: {text}
zh: 跟踪日志数: {text}

# iSpectifyTypeDebug
source: Verbose & debug
ar: مفصل وتصحيح
de: Ausführlich & Debuggen
es: Detallado y depuración
fr: Verbeux et débogage
hi: विस्तृत और डिबग
ja: 詳細およびデバッグ
kk: Толық және жөндеу
ko: 상세 및 디버그
pt: Verboso e depuração
ru: Подробные и отладочные
zh: 详细和调试

# iSpectifyTypeDebugCount
source: Verbose and debug logs count: {text}
ar: عدد السجلات المفصلة وسجلات التصحيح: {text}
de: Anzahl der ausführlichen und Debug-Protokolle: {text}
es: Cantidad de registros detallados y de depuración: {text}
fr: Nombre de journaux verbeux et de débogage : {text}
hi: विस्तृत और डिबग लॉग की संख्या: {text}
ja: 詳細およびデバッグログ数: {text}
kk: Толық және жөндеу жазбаларының саны: {text}
ko: 상세 및 디버그 로그 수: {text}
pt: Contagem de logs verbosos e de depuração: {text}
ru: Количество подробных и отладочных записей: {text}
zh: 详细和调试日志数: {text}

# iSpectifyTypeErrors
source: Errors
ar: أخطاء
de: Fehler
es: Errores
fr: Erreurs
hi: त्रुटियाँ
ja: エラー
kk: Қателер
ko: 오류
pt: Erros
ru: Ошибки
zh: 错误

# iSpectifyTypeErrorsCount
source: Error logs count: {text}
ar: عدد سجلات الأخطاء: {text}
de: Anzahl der Fehlerprotokolle: {text}
es: Cantidad de registros de errores: {text}
fr: Nombre de journaux d'erreurs : {text}
hi: त्रुटि लॉग की संख्या: {text}
ja: エラーログ数: {text}
kk: Қате жазбаларының саны: {text}
ko: 오류 로그 수: {text}
pt: Contagem de logs de erros: {text}
ru: Количество записей об ошибках: {text}
zh: 错误日志数: {text}

# iSpectifyTypeExceptions
source: Exceptions
ar: استثناءات
de: Ausnahmen
es: Excepciones
hi: अपवाद
ja: 例外
kk: Ерекшеліктер
ko: 예외
pt: Exceções
ru: Исключения
zh: 异常
