Repository: yelmuratoff/ispect
Catalog: packages/ispect/lib/src/core/localization/translations/intl_*.arb
Languages: ar, de, es, fr, hi, ja, kk, ko, pt, ru, zh

source: Actions
ar: إجراءات
de: Aktionen
es: Acciones
hi: कार्रवाइयाँ
ja: アクション
kk: Әрекеттер
ko: 작업
pt: Ações
ru: Действия
zh: 操作

source: Adding attachments to issue
ar: إضافة مرفقات إلى المشكلة
de: Hinzufügen von Anhängen zum Problem
es: Añadiendo adjuntos al problema
fr: Ajout de pièces jointes au problème
hi: मुद्दे में संलग्नक जोड़ना
ja: 問題に添付ファイルを追加中
kk: Тіркемелер мәселеге қосылуда
ko: 문제에 첨부 파일 추가 중
pt: Adicionando anexos ao problema
ru: Добавление вложений к задаче
zh: 正在添加附件到问题

source: Adding status to issue
ar: إضافة حالة إلى المشكلة
de: Hinzufügen eines Status zum Problem
es: Añadiendo estado al problema
fr: Ajout d'un statut au problème
hi: मुद्दे में स्थिति जोड़ना
ja: 問題にステータスを追加中
kk: Мәселеге мәртебе қосылуда
ko: 문제에 상태 추가 중
pt: Adicionando status ao problema
ru: Добавление статуса к задаче
zh: 正在添加状态到问题

source: AI Chat
ar: دردشة الذكاء الاصطناعي
de: KI-Chat
es: Chat de IA
fr: Chat IA
hi: AI चैट
ja: AIチャット
kk: ЖИ (AI) чат
ko: AI 채팅
pt: Chat de IA
ru: AI чат
zh: AI 聊天

# aiWelcomeMessage
source: Hello! How can I help you?
ar: مرحبًا! كيف يمكنني مساعدتك؟
de: Hallo! Wie kann ich Ihnen helfen?
es: ¡Hola! ¿Cómo puedo ayudarte?
fr: Bonjour ! Comment puis-je vous aider ?
hi: हाय! मैं आपकी कैसे मदद कर सकता हूँ?
ja: こんにちは！どのようにお手伝いしましょうか？
kk: Сәлеметсіз бе! Мен сізге қалай көмектесе аламын?
ko: 안녕하세요! 어떻게 도와드릴까요?
pt: Olá! Como posso ajudar você?
ru: Привет! Чем я могу вам помочь?
zh: 你好！我能帮你什么？

# allLogsCopied
source: All logs copied in buffer
ar: تم نسخ جميع السجلات في المخزن المؤقت
de: Alle Protokolle in den Puffer kopiert
es: Todos los registros copiados en el búfer
fr: Tous les journaux copiés dans le tampon
hi: सभी लॉग बफर में कॉपी कर लिए गए
ja: すべてのログがバッファにコピーされました
kk: Барлық жазбалар алмасу буферіне көшірілді
ko: 모든 로그가 버퍼에 복사됨
pt: Todos os logs copiados no buffer
ru: Все записи скопированы в буфер обмена
zh: 所有日志已复制到缓冲区

# analyticsLogDesc
source: Event tracked and sent to analytics
ar: سجل إرسال الأحداث إلى خدمة التحليلات
de: Das Protokoll des Sendens von Ereignissen an den Analysedienst
es: El registro de envío de eventos al servicio de análisis
fr: Le journal d'envoi d'événements au service d'analyse
hi: विश्लेषण सेवा को ईवेंट भेजने का लॉग
ja: 分析サービスにイベントを送信するログ
kk: Журнал оқиғаларды талдау қызметіне жіберу логы
ko: 분석 서비스로 이벤트 전송 로그
pt: O log de envio de eventos para o serviço de análise
ru: Событие отслежено и отправлено в аналитику
zh: 发送事件到分析服务的日志

source: API token
ar: رمز API
es: Token de API
fr: Jeton API
hi: API टोकन
ja: APIトークン
kk: API токен
ko: API 토큰
pt: Token de API
ru: API токен
zh: API 令牌

source: App data
ar: بيانات التطبيق
de: App-Daten
es: Datos de la aplicación
fr: Données de l'application
hi: ऐप डेटा
ja: アプリデータ
kk: Қолданба мәліметтері
ko: 앱 데이터
pt: Dados do aplicativo
ru: Данные приложения
zh: 应用数据

# appInfo
source: Check device info & package info
ar: تحقق من معلومات الجهاز ومعلومات الحزمة
de: Geräteinformationen und Paketinformationen überprüfen
es: Ver información del dispositivo y del paquete
fr: Vérifier les informations de l'appareil et du paquet
hi: डिवाइस जानकारी और पैकेज जानकारी जांचें
ja: デバイス情報とパッケージ情報を確認
kk: Құрылғы және пакет туралы ақпаратты тексеру
ko: 기기 정보 및 패키지 정보 확인
pt: Verificar informações do dispositivo e do pacote
ru: Проверить информацию об устройстве и пакете
zh: 查看设备信息和软件包信息

source: App version
ar: إصدار التطبيق
es: Versión de la aplicación
fr: Version de l'application
hi: ऐप संस्करण
ja: アプリバージョン
kk: Қолданба нұсқасы
ko: 앱 버전
pt: Versão do aplicativo
ru: Версия приложения
zh: 应用版本

source: Attachments added
ar: تمت إضافة المرفقات
de: Anhänge hinzugefügt
es: Adjuntos añadidos
fr: Pièces jointes ajoutées
hi: संलग्नक जोड़े गए
ja: 添付ファイルが追加されました
kk: Тіркемелер қосылды
ko: 첨부 파일 추가됨
pt: Anexos adicionados
ru: Добавление вложений завершено
zh: 附件已添加

source: Authorize
ar: تفويض
de: Autorisieren
es: Autorizar
fr: Autoriser
hi: प्रमाणित करें
ja: 認証
kk: Авторизация
ko: 인증
pt: Autorizar
ru: Авторизация
zh: 授权

# backToHome
source: Go back to the main page
ar: العودة إلى الصفحة الرئيسية
de: Zurück zur Hauptseite
es: Volver a la página principal
fr: Retourner à la page principale
hi: मुख्य पृष्ठ पर वापस जाएँ
ja: メインページに戻る
kk: Басты бетке қайту
ko: 메인 페이지로 돌아가기
pt: Voltar para a página principal
ru: Вернуться на главную страницу
zh: 返回主页

source: Basic settings
ar: الإعدادات الأساسية
de: Grundeinstellungen
es: Configuraciones básicas
fr: Paramètres de base
hi: मूल सेटिंग्स
ja: 基本設定
kk: Негізгі баптаулар
ko: 기본 설정
pt: Configurações básicas
ru: Основные настройки
zh: 基本设置

# blocCloseLogDesc
source: Component closed and will no longer update
ar: تم إغلاق المكون ولن يتم تحديثه بعد الآن
de: Ein Tag, das zum Protokollieren des Schließens eines BLoC verwendet wird
es: Etiqueta usada para registrar el cierre de un BLoC
fr: Étiquette utilisée pour enregistrer la fermeture d'un BLoC
hi: BLoC बंद करने की घटना को लॉग करने के लिए उपयोग किया जाने वाला टैग
ja: BLoCの終了イベントを記録するために使用されるタグ
kk: BLoC жабылу сәтін логтау үшін қолданылатын тег
ko: BLoC 종료 이벤트를 기록하는 데 사용되는 태그
pt: Uma tag usada para registrar o fechamento de um BLoC
ru: Компонент закрылся и больше не будет обновляться
zh: 组件已关闭，不再更新

# blocCreateLogDesc
source: Component was initialized and started working
ar: تم تهيئة المكون وبدأ العمل
de: Ein Tag, das zum Protokollieren der Erstellung eines BLoC verwendet wird
es: Etiqueta usada para registrar la creación de un BLoC
fr: Étiquette utilisée pour enregistrer la création d'un BLoC
hi: BLoC बनाने की घटना को लॉग करने के लिए उपयोग किया जाने वाला टैग
ja: BLoCの作成イベントを記録するために使用されるタグ
kk: BLoC құрылу сәтін логтау үшін қолданылатын тег
ko: BLoC 생성 이벤트를 기록하는 데 사용되는 태그
pt: Uma tag usada para registrar a criação de um BLoC
ru: Компонент был инициализирован и начал работу
zh: 组件已初始化并开始工作

# blocEventLogDesc
source: Received a command to do something
ar: تم استلام أمر لفعل شيء ما
de: Ein Tag, das zum Protokollieren der Verarbeitung eines Ereignisses in einem BLoC verwendet wird
es: Etiqueta usada para registrar el procesamiento de un evento en BLoC
fr: Étiquette utilisée pour enregistrer le traitement d'un événement dans un BLoC
hi: BLoC में ईवेंट प्रोसेसिंग को लॉग करने के लिए उपयोग किया जाने वाला टैग
ja: BLoCでのイベント処理を記録するために使用されるタグ
kk: BLoC-тағы оқиғаны өңдеу сәтін логтау үшін қолданылатын тег
ko: BLoC에서 이벤트 처리를 기록하는 데 사용되는 태그
pt: Uma tag usada para registrar o processamento de um evento em um BLoC
ru: Получена команда что-то сделать
zh: 收到执行某项操作的命令

# blocTransitionLogDesc
source: Changed state in response to a command
ar: تغيرت الحالة استجابة للأمر
de: Ein Tag, das zum Protokollieren von Zustandsübergängen in einem BLoC verwendet wird
es: Etiqueta usada para registrar transiciones de estado en BLoC
fr: Étiquette utilisée pour enregistrer les transitions d'état dans un BLoC
hi: BLoC में स्थिति परिवर्तन को लॉग करने के लिए उपयोग किया जाने वाला टैग
ja: BLoCでの状態遷移を記録するために使用されるタグ
kk: BLoC-тағы күйлер арасындағы ауысуларды логтау үшін қолданылатын тег
ko: BLoC에서 상태 전환을 기록하는 데 사용되는 태그
pt: Uma tag usada para registrar transições de estado em um BLoC
ru: Состояние изменилось в ответ на команду
zh: 状态响应命令而改变

# blocStateLogDesc
source: State changed (works for both commands and direct updates)
ar: تغيرت الحالة (يعمل للأوامر والتحديثات المباشرة)
de: Ein Tag, das zum Protokollieren des aktuellen Zustands in einem BLoC verwendet wird
es: Etiqueta usada para registrar el estado actual en BLoC
fr: Étiquette utilisée pour enregistrer l'état actuel dans un BLoC
hi: BLoC में वर्तमान स्थिति को लॉग करने के लिए उपयोग किया जाने वाला टैग
ja: BLoCでの現在の状態を記録するために使用されるタグ
kk: BLoC-тағы ағымдағы күйді логтау үшін қолданылатын тег
ko: BLoC에서 현재 상태를 기록하는 데 사용되는 태그
pt: Uma tag usada para registrar o estado atual em um BLoC
ru: Состояние изменилось (работает для команд и прямых обновлений)
zh: 状态已更改（适用于命令和直接更新）

# blocDoneLogDesc
source: Finished processing a command
ar: اكتملت معالجة الأمر
ru: Обработка команды завершена
zh: 命令处理已完成

# blocErrorLogDesc
source: Error occurred while processing a command
ru: Произошла ошибка при обработке команды

source: Build version
ar: إصدار البناء
es: Versión de compilación
fr: Version de construction
hi: बिल्ड संस्करण
ja: ビルドバージョン
kk: Құрастыру нұсқасы
ko: 빌드 버전
pt: Versão de compilação
ru: Версия сборки
zh: 构建版本

source: Cache cleared
ar: تم مسح الذاكرة المؤقتة
de: Cache geleert
es: Caché borrado
fr: Cache vidé
hi: कैश साफ कर दिया गया
ja: キャッシュがクリアされました
kk: Кэш тазартылды
ko: 캐시 지워짐
pt: Cache limpo
ru: Кэш очищен
zh: 缓存已清除

# cacheSize
source: Cache size: {size}
ar: حجم الذاكرة المؤقتة: {size}
de: Cache-Größe: {size}
es: Tamaño del caché: {size}
fr: Taille du cache : {size}
hi: कैश आकार: {size}
ja: キャッシュサイズ: {size}
kk: Кэш көлемі: {size}
ko: 캐시 크기: {size}
pt: Tamanho do cache: {size}
ru: Размер кэша: {size}
zh: 缓存大小: {size}

# changeEnvironment
source: Change current environment
ar: تغيير البيئة الحالية
de: Aktuelle Umgebung ändern
es: Cambiar el entorno actual
fr: Changer l'environnement actuel
hi: वर्तमान वातावरण बदलें
ja: 現在の環境を変更
kk: Ағымдағы ортаны өзгерту
ko: 현재 환경 변경
pt: Alterar o ambiente atual
ru: Сменить текущее окружение
zh: 更改当前环境

source: Change project
ar: تغيير المشروع
de: Projekt ändern
es: Cambiar proyecto
fr: Changer de projet
hi: प्रोजेक्ट बदलें
ja: プロジェクトを変更
kk: Жобаны өзгерту
ko: 프로젝트 변경
pt: Mudar de projeto
ru: Изменить проект
zh: 更改项目

source: Change theme
ar: تغيير السمة
de: Thema ändern
es: Cambiar tema
fr: Changer de thème
hi: थीम बदलें
ja: テーマを変更
kk: Тақырыпты өзгерту
ko: 테마 변경
pt: Mudar de tema
ru: Сменить тему
zh: 更改主题

# clearHistory
source: Clean history
ar: مسح السجل
de: Verlauf löschen
es: Borrar historial
fr: Effacer l'historique
hi: इतिहास साफ करें
ja: 履歴をクリア
kk: Тарихты тазарту
ko: 기록 지우기
pt: Limpar histórico
ru: Очистить историю
zh: 清除历史记录

source: Clear cache
ar: مسح الذاكرة المؤقتة
de: Cache leeren
es: Borrar caché
fr: Vider le cache
hi: कैश साफ करें
ja: キャッシュをクリア
kk: Кэшті тазарту
ko: 캐시 지우기
pt: Limpar cache
ru: Очистить кэш
zh: 清除缓存

source: Collapse logs
ar: طي السجلات
de: Protokolle einklappen
es: Colapsar registros
fr: Réduire les journaux
hi: लॉग संक्षिप्त करें
ja: ログを折りたたむ
kk: Журналды жасыру
ko: 로그 접기
pt: Recolher logs
ru: Свернуть журнал
zh: 折叠日志

source: Common
ar: عام
de: Allgemein
es: Común
fr: Commun
hi: सामान्य
ja: 共通
kk: Жалпы
ko: 공통
pt: Comum
ru: Общие
zh: 通用

source: Copied to clipboard
ar: تم النسخ إلى الحافظة
de: In die Zwischenablage kopiert
es: Copiado al portapapeles
fr: Copié dans le presse-papiers
hi: क्लिपबोर्ड में कॉपी किया गया
ja: クリップボードにコピーされました
kk: Алмасу буферіне көшірілді
ko: 클립보드에 복사됨
pt: Copiado para a área de transferência
ru: Скопировано в буфер обмена
zh: 已复制到剪贴板

source: Copy
ar: نسخ
de: Kopieren
es: Copiar
fr: Copier
hi: कॉपी करें
ja: コピー
kk: Көшіру
ko: 복사
pt: Copiar
ru: Скопировать
zh: 复制

source: Copy all logs
ar: نسخ جميع السجلات
de: Alle Protokolle kopieren
es: Copiar todos los registros
fr: Copier tous les journaux
hi: सभी लॉग कॉपी करें
ja: すべてのログをコピー
kk: Барлық жазбаларды көшіру
ko: 모든 로그 복사
pt: Copiar todos os logs
ru: Копировать все записи
zh: 复制所有日志

# counterTimesText
source: You have pushed the button this many times: {number}
ar: لقد ضغطت على الزر هذا العدد من المرات: {number}
de: Sie haben den Knopf so oft gedrückt: {number}
es: Has pulsado el botón tantas veces: {number}
fr: Vous avez appuyé sur le bouton autant de fois : {number}
hi: आपने इस बटन को इतनी बार दबाया है: {number}
ja: このボタンを{number}回押しました:
kk: Сіз түймені сонша рет басқансыз: {number}
ko: 이 버튼을 {number}번 눌렀습니다:
pt: Você pressionou o botão tantas vezes: {number}
ru: Вы нажали кнопку столько раз: {number}
zh: 你已点击按钮次数: {number}

source: Create issue
ar: إنشاء مشكلة
de: Problem erstellen
es: Crear problema
fr: Créer un problème
hi: मुद्दा बनाएँ
ja: 問題を作成
kk: Мәселені құру
ko: 문제 생성
pt: Criar problema
ru: Создать задачу
zh: 创建问题

source: Create Jira Issue
ar: إنشاء مشكلة في Jira
de: Jira-Problem erstellen
es: Crear problema en Jira
fr: Créer un problème Jira
hi: Jira मुद्दा बनाएँ
ja: Jiraの問題を作成
kk: Jira Issue істеу
ko: Jira 문제 생성
pt: Criar problema no Jira
ru: Создать Jira Issue
zh: 创建 Jira 问题

source: Creating issue
ar: جارٍ إنشاء المشكلة
de: Problem wird erstellt
es: Creando problema
fr: Création d'un problème
hi: मुद्दा बनाया जा रहा है
ja: 問題を作成中
kk: Мәселе құрылуда
ko: 문제 생성 중
pt: Criando problema
ru: Создание задачи
zh: 正在创建问题

# criticalLogDesc
source: Critical error that needs immediate attention
ar: علامة تُستخدم لتسجيل الأخطاء الحرجة أو الأحداث التي تتطلب اهتمامًا فوريًا
de: Ein Tag, das zum Protokollieren kritischer Fehler oder Ereignisse verwendet wird, die sofortige Aufmerksamkeit erfordern
es: Etiqueta usada para registrar errores críticos o eventos que requieren atención inmediata
fr: Étiquette utilisée pour enregistrer les erreurs critiques ou les événements nécessitant une attention immédiate
hi: तत्काल ध्यान देने योग्य गंभीर त्रुटियों या घटनाओं को लॉग करने के लिए उपयोग किया जाने वाला टैग
ja: 即時対応が必要な重大なエラーやイベントを記録するために使用されるタグ
kk: Шұғыл назар аударуды қажет ететін сыни қателер мен оқиғаларды логтау үшін қолданылатын тег
ko: 즉각적인 주의가 필요한 치명적인 오류 또는 이벤트를 기록하는 데 사용되는 태그
pt: Uma tag usada para registrar erros críticos ou eventos que requerem atenção imediata
ru: Критическая ошибка требующая немедленного внимания
zh: 用于记录需要立即关注的关键错误或事件的日志标签

source: Data
ar: بيانات
de: Daten
es: Datos
fr: Données
hi: डेटा
ja: データ
kk: Деректер
ko: 데이터
pt: Dados
ru: Данные
zh: 数据

# debugLogDesc
source: Technical details for developers to analyze behavior
ar: علامة تُستخدم لتسجيل معلومات التصحيح لتحليل سلوك التطبيق
de: Ein Tag, das zum Protokollieren von Debug-Informationen verwendet wird, um das Verhalten der Anwendung zu analysieren
es: Etiqueta usada para registrar información de depuración para analizar el comportamiento de la aplicación
fr: Étiquette utilisée pour enregistrer des informations de débogage afin d'analyser le comportement de l'application
hi: ऐप के व्यवहार का विश्लेषण करने के लिए डिबग जानकारी लॉग करने के लिए उपयोग किया जाने वाला टैग
ja: アプリの動作を分析するためのデバッグ情報を記録するタグ
kk: Қолданбаның жұмысын талдау үшін отладка ақпаратын логтау үшін қолданылатын тег
ko: 앱 동작을 분석하기 위해 디버그 정보를 기록하는 데 사용되는 태그
pt: Uma tag usada para registrar informações de depuração para analisar o comportamento do aplicativo
ru: Технические детали для разработчиков для анализа поведения
zh: 用于记录调试信息以分析应用程序行为的日志标签

source: Description
ar: الوصف
de: Beschreibung
es: Descripción
hi: विवरण
ja: 説明
kk: Сипаттама
ko: 설명
pt: Descrição
ru: Описание
zh: 描述

source: Draw
ar: رسم
de: Zeichnen
es: Dibujar
fr: Dessiner
hi: ड्रा करें
ja: 描画
kk: Сурет салу
ko: 그리기
pt: Desenhar
ru: Рисование
zh: 绘制

source: Enabled
ar: مُفعّل
de: Aktiviert
es: Habilitado
fr: Activé
hi: सक्षम
ja: 有効
kk: Қосылған
ko: 활성화됨
pt: Habilitado
ru: Включено
zh: 已启用

# environmentTapNumber
source: To open the dialog, it remains: {number}
ar: لفتح الحوار، يتبقى: {number}
de: Um den Dialog zu öffnen, verbleiben: {number}
es: Para abrir el diálogo, faltan: {number}
fr: Pour ouvrir la boîte de dialogue, il reste : {number}
hi: संवाद खोलने के लिए बाकी है: {number}
ja: ダイアログを開くまであと{number}回
kk: Диалогты ашу үшін қалған: {number}
ko: 대화 상자를 열려면 {number}번 남음
pt: Para abrir o diálogo, resta: {number}
ru: Для открытия диалога осталось: {number}
zh: 打开对话框还需点击: {number}

# errorCacheClearing
source: Error on clearing cache
ar: خطأ أثناء مسح الذاكرة المؤقتة
de: Fehler beim Leeren des Caches
es: Error al borrar el caché
fr: Erreur lors de la suppression du cache
hi: कैश साफ करने में त्रुटि
ja: キャッシュクリア時のエラー
kk: Кэш тазарту қатесі
ko: 캐시 지우기 오류
pt: Erro ao limpar o cache
ru: Ошибка при очистке кэша
zh: 清除缓存时出错

# errorLogDesc
source: Something went wrong in the app
ar: علامة تُستخدم لتسجيل الأخطاء التي تحدث في التطبيق
de: Ein Tag, das zum Protokollieren von Fehlern verwendet wird, die in der Anwendung auftreten
es: Etiqueta usada para registrar errores que ocurren en la aplicación
fr: Étiquette utilisée pour enregistrer les erreurs survenant dans l'application
hi: ऐप में होने वाली त्रुटियों को लॉग करने के लिए उपयोग किया जाने वाला टैग
ja: アプリで発生するエラーを記録するために使用されるタグ
kk: Қолданбада туындаған қателерді логтау үшін қолданылатын тег
ko: 앱에서 발생하는 오류를 기록하는 데 사용되는 태그
pt: Uma tag usada para registrar erros que ocorrem no aplicativo
ru: Что-то пошло не так в приложении
zh: 用于记录应用程序中发生的错误的日志标签

source: Error message
ar: رسالة الخطأ
de: Fehlermeldung
es: Mensaje de error
fr: Message d'erreur
hi: त्रुटि संदेश
ja: エラーメッセージ
kk: Қате туралы хабар
ko: 오류 메시지
pt: Mensagem de erro
ru: Текст ошибки
zh: 错误消息

source: Error type
ar: نوع الخطأ
de: Fehlertyp
es: Tipo de error
fr: Type d'erreur
hi: त्रुटि प्रकार
ja: エラータイプ
kk: Қате түрі
ko: 오류 유형
pt: Tipo de erro
ru: Тип ошибки
zh: 错误类型

# exceptionLogDesc
source: Unexpected error occurred
ar: علامة تُستخدم لتسجيل الاستثناءات التي تحدث في التطبيق
de: Ein Tag, das zum Protokollieren von Ausnahmen verwendet wird, die in der Anwendung auftreten
es: Etiqueta usada para registrar excepciones que ocurren en la aplicación
fr: Étiquette utilisée pour enregistrer les exceptions survenant dans l'application
hi: ऐप में होने वाली अपवादों को लॉग करने के लिए उपयोग किया जाने वाला टैग
ja: アプリで発生する例外を記録するために使用されるタグ
kk: Қолданбада пайда болатын ерекшеліктерді логтау үшін қолданылатын тег
ko: 앱에서 발생하는 예외를 기록하는 데 사용되는 태그
pt: Uma tag usada para registrar exceções que ocorrem no aplicativo
ru: Произошла неожиданная ошибка
zh: 用于记录应用程序异常的日志标签

source: Expand logs
ar: توسيع السجلات
de: Protokolle ausklappen
es: Expandir registros
fr: Développer les journaux
hi: लॉग विस्तार करें
ja: ログを展開
kk: Журналды ашу
ko: 로그 펼치기
pt: Expandir logs
ru: Развернуть журнал
zh: 展开日志

# feedbackDescriptionText
source: Describe the problem
ar: صف المشكلة
de: Beschreiben Sie das Problem
es: Describe el problema
fr: Décrivez le problème
hi: समस्या का वर्णन करें
ja: 問題を説明してください
kk: Мәселені сипаттаңыз
ko: 문제를 설명하세요
pt: Descreva o problema
ru: Опишите проблему
zh: 描述问题

source: Field is required
ar: الحقل مطلوب
de: Feld ist erforderlich
es: El campo es obligatorio
fr: Le champ est requis
hi: यह फ़ील्ड आवश्यक है
ja: 必須フィールドです
kk: Міндетті түрде толтыру керек
ko: 필수 필드입니다
pt: O campo é obrigatório
ru: Поле обязательно для заполнения
zh: 字段必填

source: Finished
ar: منتهي
de: Abgeschlossen
es: Finalizado
fr: Terminé
hi: समाप्त
ja: 完了
kk: Бітті
ko: 완료
pt: Concluído
ru: Закончено
zh: 已完成

# fix
source: Report
ar: الإبلاغ
de: Melden
es: Informar
fr: Signaler
hi: रिपोर्ट करें
ja: 報告
kk: Хабарлау
ko: 보고
pt: Relatar
ru: Сообщить
zh: 报告

source: Full URL
ar: الرابط الكامل
de: Vollständige URL
es: URL completa
fr: URL complète
hi: पूर्ण URL
ja: 完全なURL
kk: Толық сілтеме
ko: 전체 URL
pt: URL completa
ru: Полная ссылка
zh: 完整 URL

# generateReport
source: Generate a report
ar: إنشاء تقرير
de: Einen Bericht erstellen
es: Generar un informe
fr: Générer un rapport
hi: रिपोर्ट उत्पन्न करें
ja: レポートを生成
kk: AI eсеп жасау
ko: 보고서 생성
pt: Gerar um relatório
ru: Генерация отчёта
zh: 生成报告

source: Go to logger
ar: الذهاب إلى المسجل
de: Zum Logger gehen
es: Ir al registrador
fr: Aller au journaliseur
hi: लॉगर पर जाएँ
ja: ロガーへ移動
kk: Журналға өту
ko: 로거로 이동
pt: Ir para o logger
ru: Перейти к журналу
zh: 转到日志记录器

# goodLogDesc
source: Operation completed successfully
ar: علامة تُستخدم لتسجيل العمليات الناجحة أو الأحداث الإيجابية في التطبيق
de: Ein Tag, das zum Protokollieren erfolgreicher Operationen oder positiver Ereignisse in der Anwendung verwendet wird
es: Etiqueta usada para registrar operaciones exitosas o eventos positivos en la aplicación
fr: Étiquette utilisée pour enregistrer les opérations réussies ou les événements positifs dans l'application
hi: ऐप में सफल संचालन या सकारात्मक घटनाओं को लॉग करने के लिए उपयोग किया जाने वाला टैग
ja: アプリでの成功した操作や肯定的なイベントを記録するために使用されるタグ
kk: Қолданбадағы сәтті әрекеттер мен оң оқиғаларды логтау үшін қолданылатын тег
ko: 앱에서 성공적인 작업 또는 긍정적인 이벤트를 기록하는 데 사용되는 태그
pt: Uma tag usada para registrar operações bem-sucedidas ou eventos positivos no aplicativo
ru: Операция завершена успешно
zh: 用于记录成功操作或应用中的正面事件的日志标签

source: Headers
ar: الرؤوس
de: Header
es: Encabezados
fr: En-têtes
hi: हेडर
ja: ヘッダー
ko: 헤더
pt: Cabeçalhos
ru: Заголовки
zh: 请求头

source: Hide panel
ar: إخفاء اللوحة
de: Panel ausblenden
es: Ocultar panel
fr: Masquer le panneau
hi: पैनल छिपाएँ
ja: パネルを隠す
kk: Панельді жасыру
ko: 패널 숨기기
pt: Ocultar painel
ru: Скрыть панель
zh: 隐藏面板

# httpErrorLogDesc
source: Server request failed
ar: سجل أخطاء طلب الخادم
de: Serveranfrage-Fehlerprotokoll
es: Registro de errores de solicitud al servidor
fr: Journal des erreurs de requête au serveur
hi: सर्वर अनुरोध त्रुटि लॉग
ja: サーバーリクエストエラーログ
kk: Серверге сұраныс жіберу қатесі журналы
ko: 서버 요청 오류 로그
pt: Log de erro de solicitação ao servidor
ru: Запрос к серверу завершился ошибкой
zh: 服务器请求错误日志

# httpRequestLogDesc
source: Request sent to server
ar: سجل طلب الخادم
de: Serveranfrage-Protokoll
es: Registro de solicitud al servidor
fr: Journal des requêtes au serveur
hi: सर्वर अनुरोध लॉग
ja: サーバーリクエストログ
kk: Серверге жіберілген сұраныс журналы
ko: 서버 요청 로그
pt: Log de solicitação ao servidor
ru: Запрос отправлен на сервер
zh: 服务器请求日志

# httpResponseLogDesc
source: Response received from server
ar: سجل استجابة الخادم
de: Serverantwort-Protokoll
es: Registro de respuesta del servidor
fr: Journal des réponses du serveur
hi: सर्वर प्रतिक्रिया लॉग
ja: サーバーレスポンスログ
kk: Жіберілген сұранысқа серверден жауап журналы
ko: 서버 응답 로그
pt: Log de resposta do servidor
ru: Получен ответ от сервера
zh: 服务器响应日志

# infoLogDesc
source: General information about what's happening
ar: علامة تُستخدم لتسجيل رسائل معلوماتية حول تشغيل التطبيق
de: Ein Tag, das zum Protokollieren informativer Nachrichten über den Betrieb der Anwendung verwendet wird
es: Etiqueta usada para registrar mensajes informativos sobre el funcionamiento de la aplicación
fr: Étiquette utilisée pour enregistrer des messages informatifs sur le fonctionnement de l'application
hi: ऐप के संचालन के बारे में सूचनात्मक संदेशों को लॉग करने के लिए उपयोग किया जाने वाला टैग
ja: アプリの動作に関する情報メッセージを記録するために使用されるタグ
kk: Қолданбаның жұмысын сипаттайтын ақпараттық хабарламаларды логтау үшін қолданылатын тег
ko: 앱 작동에 대한 정보 메시지를 기록하는 데 사용되는 태그
pt: Uma tag usada para registrar mensagens informativas sobre o funcionamento do aplicativo
ru: Общая информация о том, что происходит
zh: 用于记录应用程序运行信息的日志标签

source: Initialization failed
ar: فشل التهيئة
de: Initialisierung fehlgeschlagen
es: Falló la inicialización
fr: Échec de l'initialisation
hi: प्रारंभिकरण विफल
ja: 初期化に失敗しました
kk: Бастапқы жүктеу қатесі
ko: 초기화 실패
pt: Falha na inicialização
ru: Инициализация не удалась
zh: 初始化失败

# issueCreated
source: Issue successfully created
ar: تم إنشاء المشكلة بنجاح
de: Problem erfolgreich erstellt
es: Problema creado con éxito
fr: Problème créé avec succès
hi: मुद्दा सफलतापूर्वक बनाया गया
ja: 問題が正常に作成されました
kk: Мәселе құрылды
ko: 문제가 성공적으로 생성됨
pt: Problema criado com sucesso
ru: Задача успешно создана
zh: 问题创建成功
