Repository: yelmuratoff/ispect
Catalog: packages/ispect/lib/src/core/localization/translations/intl_*.arb
Languages: ar, de, es, fr, hi, ja, kk, ko, pt, ru, zh

# iSpectifyTypeExceptionsCount
source: Exception logs count: {text}
ar: عدد سجلات الاستثناءات: {text}
de: Anzahl der Ausnahmeprotokolle: {text}
es: Cantidad de registros de excepciones: {text}
fr: Nombre de journaux d'exceptions : {text}
hi: अपवाद लॉग की संख्या: {text}
ja: 例外ログ数: {text}
kk: Ерекшелік жазбаларының саны: {text}
ko: 예외 로그 수: {text}
pt: Contagem de logs de exceções: {text}
ru: Количество записей исключений: {text}
zh: 异常日志数: {text}

# iSpectifyTypeGood
source: Good
ar: جيد
de: Gut
es: Bueno
fr: Bon
hi: अच्छा
ja: 成功
kk: Жақсы
ko: 성공
pt: Bom
ru: Хорошие
zh: 成功

# iSpectifyTypeGoodCount
source: Good logs count: {text}
ar: عدد السجلات الجيدة: {text}
de: Anzahl der guten Protokolle: {text}
es: Cantidad de registros buenos: {text}
fr: Nombre de journaux bons : {text}
hi: अच्छे लॉग की संख्या: {text}
ja: 成功ログ数: {text}
kk: Жақсы жазбаларының саны: {text}
ko: 성공 로그 수: {text}
pt: Contagem de logs bons: {text}
ru: Количество хороших записей: {text}
zh: 成功日志数: {text}

# iSpectifyTypeHttp
source: HTTP requests
ar: طلبات HTTP
de: HTTP-Anfragen
es: Solicitudes HTTP
fr: Requêtes HTTP
hi: HTTP अनुरोध
ja: HTTPリクエスト
kk: HTTP сұраныстар
ko: HTTP 요청
pt: Solicitações HTTP
ru: HTTP запросы
zh: HTTP 请求

# iSpectifyTypeInfo
source: Info
ar: معلومات
es: Información
hi: जानकारी
ja: 情報
kk: Ақпарат
ko: 정보
pt: Informação
ru: Информация
zh: 信息

# iSpectifyTypeInfoCount
source: Info logs count: {text}
ar: عدد سجلات المعلومات: {text}
de: Anzahl der Info-Protokolle: {text}
es: Cantidad de registros de información: {text}
fr: Nombre de journaux d'informations : {text}
hi: जानकारी लॉग की संख्या: {text}
ja: 情報ログ数: {text}
kk: Ақпараттық жазбаларының саны: {text}
ko: 정보 로그 수: {text}
pt: Contagem de logs de informação: {text}
ru: Количество информационных записей: {text}
zh: 信息日志数: {text}

# iSpectifyTypePrint
source: Print method
ar: طريقة الطباعة
de: Druckmethode
es: Método de impresión
fr: Méthode d'impression
hi: प्रिंट विधि
ja: 印刷メソッド
kk: Print методы
ko: 출력 메서드
pt: Método de impressão
ru: Print метод
zh: 打印方法

# iSpectifyTypePrintCount
source: Print method logs count: {text}
ar: عدد سجلات طريقة الطباعة: {text}
de: Anzahl der Druckmethoden-Protokolle: {text}
es: Cantidad de registros del método de impresión: {text}
fr: Nombre de journaux de la méthode d'impression : {text}
hi: प्रिंट विधि लॉग की संख्या: {text}
ja: 印刷メソッドログ数: {text}
kk: Print метод жазбалар саны: {text}
ko: 출력 메서드 로그 수: {text}
pt: Contagem de logs do método de impressão: {text}
ru: Количество print записей: {text}
zh: 打印方法日志数: {text}

# iSpectifyTypeProvider
source: Providers
ar: المزودون
de: Provider
es: Proveedores
fr: Fournisseurs
hi: प्रोवाइडर
ja: プロバイダー
kk: Провайдерлер
ko: 프로바이더
pt: Provedores
ru: Провайдеры
zh: 提供者

# iSpectifyTypeProviderCount
source: Provider logs count: {text}
ar: عدد سجلات المزودين: {text}
de: Anzahl der Provider-Protokolle: {text}
es: Cantidad de registros de proveedores: {text}
fr: Nombre de journaux de fournisseurs : {text}
hi: प्रोवाइडर लॉग की संख्या: {text}
ja: プロバイダーログ数: {text}
kk: Провайдерлер жазбаларының саны: {text}
ko: 프로바이더 로그 수: {text}
pt: Contagem de logs de provedores: {text}
ru: Количество записей провайдеров: {text}
zh: 提供者日志数: {text}

# providerLogDesc
source: State provider activity logged
ru: Активность провайдера состояния залогирована

# iSpectifyTypeWarnings
source: Warnings
ar: تحذيرات
de: Warnungen
es: Advertencias
fr: Avertissements
hi: चेतावनियाँ
ja: 警告
kk: Ескертулер
ko: 경고
pt: Avisos
ru: Предупреждения
zh: 警告

# iSpectifyTypeWarningsCount
source: Warning logs count: {text}
ar: عدد سجلات التحذيرات: {text}
de: Anzahl der Warnungsprotokolle: {text}
es: Cantidad de registros de advertencias: {text}
fr: Nombre de journaux d'avertissements : {text}
hi: चेतावनी लॉग की संख्या: {text}
ja: 警告ログ数: {text}
kk: Ескертулер саны: {text}
ko: 경고 로그 수: {text}
pt: Contagem de logs de avisos: {text}
ru: Количество предупреждений: {text}
zh: 警告日志数: {text}

# testerLogDesc
source: It will be useful for testers to know about these logs
ar: سيكون من المفيد للمختبرين معرفة هذه السجلات
de: Es wird für Tester nützlich sein, über diese Protokolle Bescheid zu wissen
es: Será útil para los testers saber sobre estos registros
fr: Ces journaux seront utiles aux testeurs pour en savoir plus
hi: इन लॉग के बारे में जानना टेस्टर के लिए उपयोगी होगा
ja: テスターがこれらのログを知るのに役立ちます
kk: Тестерлер үшін бұл журналдар туралы білу пайдалы болады
ko: 테스터가 이 로그를 아는 데 유용할 것입니다
pt: Será útil para os testadores saberem sobre esses logs
ru: Для тестировщиков будет полезно знать про эти логи
zh: 测试人员可以使用这些日志

# totalFilesCount
source: Total files count: {number}
ar: إجمالي عدد الملفات: {number}
de: Gesamtzahl der Dateien: {number}
es: Cantidad total de archivos: {number}
fr: Nombre total de fichiers : {number}
hi: कुल फाइलों की संख्या: {number}
ja: 総ファイル数: {number}
kk: Барлық файлдар саны: {number}
ko: 총 파일 수: {number}
pt: Contagem total de arquivos: {number}
ru: Общее количество файлов: {number}
zh: 文件总数: {number}

source: Turn off inspector
ar: إيقاف المفتش
de: Inspektor ausschalten
es: Apagar inspector
fr: Désactiver l'inspecteur
hi: इंस्पेक्टर बंद करें
ja: インスペクターをオフ
kk: Инспекторды өшіру
ko: 인스펙터 끄기
pt: Desligar inspetor
ru: Выключить инспектор
zh: 关闭检查器

source: Turn on inspector
ar: تشغيل المفتش
de: Inspektor einschalten
es: Encender inspector
fr: Activer l'inspecteur
hi: इंस्पेक्टर चालू करें
ja: インスペクターをオン
kk: Инспекторды қосу
ko: 인스펙터 켜기
pt: Ligar inspetor
ru: Включить инспектор
zh: 打开检查器

# typeMessage
source: Type a message
ar: اكتب رسالة
de: Nachricht eingeben
es: Escribe un mensaje
fr: Tapez un message
hi: संदेश टाइप करें
ja: メッセージを入力
kk: Сұрауды теріңіз
ko: 메시지 입력
pt: Digite uma mensagem
ru: Введите запрос
zh: 输入消息

source: Upload images
ar: رفع الصور
de: Bilder hochladen
es: Subir imágenes
fr: Télécharger des images
hi: छवियाँ अपलोड करें
ja: 画像をアップロード
kk: Суреттерді жүктеу
ko: 이미지 업로드
pt: Carregar imagens
ru: Загрузить изображения
zh: 上传图片

source: Use console logs
ar: استخدام سجلات وحدة التحكم
de: Konsolenprotokolle verwenden
es: Usar registros de consola
fr: Utiliser les journaux de la console
hi: कंसोल लॉग का उपयोग करें
ja: コンソールログを使用
kk: Консоль жазбаларын пайдалану
ko: 콘솔 로그 사용
pt: Usar logs do console
ru: Использовать запись в консоль
zh: 使用控制台日志

source: Use history
ar: استخدام السجل
de: Verlauf verwenden
es: Usar historial
fr: Utiliser l'historique
hi: इतिहास का उपयोग करें
ja: 履歴を使用
kk: Тарихты пайдалану
ko: 기록 사용
pt: Usar histórico
ru: Использовать историю
zh: 使用历史记录

source: User email
ar: البريد الإلكتروني للمستخدم
de: Benutzer-E-Mail
es: Correo del usuario
fr: Email de l'utilisateur
hi: उपयोगकर्ता ईमेल
ja: ユーザーメール
kk: Электрондық пошта
ko: 사용자 이메일
pt: Email do usuário
ru: Email пользователя
zh: 用户邮箱

# verboseLogDesc
source: Detailed technical information for debugging
ar: علامة تُستخدم لتسجيل معلومات مفصلة لتحليل التطبيق بعمق
de: Ein Tag, das zum Protokollieren detaillierter Informationen für eine tiefgehende Analyse der Anwendung verwendet wird
es: Etiqueta usada para registrar información detallada para un análisis profundo de la aplicación
fr: Étiquette utilisée pour enregistrer des informations détaillées pour une analyse approfondie de l'application
hi: ऐप के गहन विश्लेषण के लिए विस्तृत जानकारी लॉग करने के लिए उपयोग किया जाने वाला टैग
ja: アプリの詳細な分析のために詳細情報を記録するタグ
kk: Қолданбаны терең талдау үшін егжей-тегжейлі ақпаратты логтау үшін қолданылатын тег
ko: 앱을 심층적으로 분석하기 위해 자세한 정보를 기록하는 데 사용되는 태그
pt: Uma tag usada para registrar informações detalhadas para análise aprofundada do aplicativo
ru: Подробная техническая информация для отладки
zh: 用于记录详细信息以进行深入分析的日志标签

# viewAndManageData
source: Viewing and managing application data
ar: عرض وإدارة بيانات التطبيق
de: Anzeigen und Verwalten von Anwendungsdaten
es: Visualización y gestión de datos de la aplicación
fr: Visualisation et gestion des données de l'application
hi: ऐप डेटा देखना और प्रबंधन करना
ja: アプリデータの表示と管理
kk: Қолданба мәліметтерін қарау және басқару
ko: 앱 데이터 보기 및 관리
pt: Visualização e gerenciamento de dados do aplicativo
ru: Просмотр и управление данными приложения
zh: 查看和管理应用程序数据

# warningLogDesc
source: Potential issue that might cause problems
ar: علامة تُستخدم لتسجيل رسائل تحذير حول مشكلات محتملة في التطبيق
de: Ein Tag, das zum Protokollieren von Warnmeldungen über potenzielle Probleme in der Anwendung verwendet wird
es: Etiqueta usada para registrar mensajes de advertencia sobre posibles problemas en la aplicación
fr: Étiquette utilisée pour enregistrer des messages d'avertissement sur des problèmes potentiels dans l'application
hi: ऐप में संभावित समस्याओं के बारे में चेतावनी संदेशों को लॉग करने के लिए उपयोग किया जाने वाला टैग
ja: アプリでの潜在的な問題に関する警告メッセージを記録するタグ
kk: Қолданбадағы ықтимал мәселелер туралы ескерту хабарламаларын логтау үшін қолданылатын тег
ko: 앱에서 잠재적인 문제에 대한 경고 메시지를 기록하는 데 사용되는 태그
pt: Uma tag usada para registrar mensagens de aviso sobre possíveis problemas no aplicativo
ru: Потенциальная проблема которая может вызвать сбои
zh: 用于记录潜在问题的警告消息的日志标签

source: You
ar: أنت
de: Sie
es: Tú
fr: Vous
hi: आप
ja: あなた
kk: Сіз
ko: 당신
pt: Você
ru: Вы
zh: 你

# youAlreadyInLogger
source: You are already in the logger page
ar: أنت بالفعل في صفحة المسجل
de: Sie befinden sich bereits auf der Logger-Seite
es: Ya estás en la página del registrador
fr: Vous êtes déjà sur la page du journaliseur
hi: आप पहले से ही लॉगर पेज पर हैं
ja: すでにロガーページにいます
kk: Сіз ISpect бетінде тұрсыз
ko: 이미 로거 페이지에 있습니다
pt: Você já está na página do logger
ru: Вы уже на странице ISpect
zh: 您已在日志记录页面

source: No data
ar: لا توجد بيانات
de: Keine Daten
es: Sin datos
fr: Aucune donnée
hi: कोई डेटा नहीं
ja: データなし
kk: Деректер жоқ
ko: 데이터 없음
pt: Sem dados
ru: Нет данных
zh: 无数据

source: Share log (full)
ar: مشاركة السجل (كامل)
de: Protokoll teilen (vollständig)
es: Compartir registro (completo)
fr: Partager le journal (complet)
hi: लॉग साझा करें (पूर्ण)
ja: ログを共有（完全）
kk: Логты бөлісу (толық)
ko: 로그 공유 (전체)
pt: Compartilhar log (completo)
ru: Поделиться логом (полностью)
zh: 分享日志（完整）

source: Copy to clipboard (truncated)
ar: نسخ إلى الحافظة (مختصر)
de: In die Zwischenablage kopieren (gekürzt)
es: Copiar al portapapeles (truncado)
fr: Copier dans le presse-papiers (tronqué)
hi: क्लिपबोर्ड में कॉपी करें (संक्षिप्त)
ja: クリップボードにコピー（省略）
kk: Алмасу буферіне көшіру (қысқартылған)
ko: 클립보드에 복사 (잘린 형태)
pt: Copiar para a área de transferência (truncado)
ru: Скопировать в буфер обмена (сокращенно)
zh: 复制到剪贴板（截断）

# viewThemeScheme
source: View Theme Scheme screen
ar: عرض شاشة مخطط الموضوع
de: Theme-Schema-Bildschirm anzeigen
es: Ver pantalla de esquema de tema
hi: थीम स्कीम स्क्रीन देखें
ja: テーマスキーマ画面を表示
kk: Тема схемасы экранын көру
pt: Ver tela de esquema de tema
ru: Просмотр экрана схемы темы
zh: 查看主题方案屏幕

# takeScreenshotFeedback
source: Take a screenshot and send feedback
ar: التقط لقطة شاشة وأرسل تعليقاً
de: Screenshot machen und Feedback senden
es: Tomar captura de pantalla y enviar comentarios
hi: स्क्रीनशॉट लें और फीडबैक भेजें
ja: スクリーンショットを撮ってフィードバックを送信
kk: Скриншот түсіру және пікір жіберу
pt: Tirar captura de tela e enviar feedback
ru: Сделать скриншот и отправить отзыв
zh: 截屏并发送反馈

# zoomPickColor
source: Zoom in and pick a color
ar: تكبير واختيار لون
de: Hineinzoomen und Farbe auswählen
es: Acercar y elegir color
hi: ज़ूम इन करें और रंग चुनें
ja: ズームインして色を選択
kk: Үлкейту және түс таңдау
pt: Ampliar e escolher cor
ru: Увеличить и выбрать цвет
zh: 放大并选择颜色

# inspectWidgets
source: Inspect widgets on the screen
ar: فحص العناصر على الشاشة
de: Widgets auf dem Bildschirm überprüfen
es: Inspeccionar widgets en pantalla
hi: स्क्रीन पर विजेट्स का निरीक्षण करें
ja: 画面上のウィジェットを検査
kk: Экрандағы виджеттерді тексеру
pt: Inspecionar widgets na tela
ru: Проверить виджеты на экране
zh: 检查屏幕上的组件

source: Toggle performance tracking
ar: تبديل تتبع الأداء
de: Leistungsverfolgung umschalten
es: Alternar seguimiento de rendimiento
hi: प्रदर्शन ट्रैकिंग टॉगल करें
ja: パフォーマンス追跡を切り替え
kk: Өнімділік қадағалауын ауыстыру
pt: Alternar rastreamento de desempenho
ru: Переключить отслеживание производительности
zh: 切换性能跟踪

# openLogViewer
source: Open the log viewer
ar: فتح عارض السجلات
de: Protokoll-Viewer öffnen
es: Abrir visor de registros
hi: लॉग व्यूअर खोलें
ja: ログビューアを開く
kk: Лог көрушісін ашу
pt: Abrir visualizador de logs
ru: Открыть просмотрщик логов
zh: 打开日志查看器

# backToMainScreen
source: Back to the main screen
ar: العودة إلى الشاشة الرئيسية
de: Zurück zum Hauptbildschirm
es: Volver a la pantalla principal
hi: मुख्य स्क्रीन पर वापस जाएँ
ja: メイン画面に戻る
kk: Негізгі экранға оралу
pt: Voltar à tela principal
ru: Вернуться на главный экран
zh: 返回主屏幕

source: Daily Sessions
ar: الجلسات اليومية
de: Tägliche Sitzungen
es: Sesiones diarias
hi: दैनिक सत्र
ja: 日次セッション
kk: Күнделікті сессиялар
pt: Sessões diárias
ru: Ежедневные сессии
zh: 每日会话

source: Log Viewer
ar: عارض السجلات
de: Protokoll-Viewer
es: Visor de registros
hi: लॉग व्यूअर
ja: ログビューア
kk: Лог көруші
pt: Visualizador de logs
ru: Просмотрщик логов
zh: 日志查看器

source: Sessions
ar: الجلسات
de: Sitzungen
es: Sesiones
hi: सत्र
ja: セッション
kk: Сессиялар
pt: Sessões
ru: Сессии
zh: 会话

source: Clear all sessions
ar: مسح جميع الجلسات
de: Alle Sitzungen löschen
es: Borrar todas las sesiones
hi: सभी सत्र साफ़ करें
ja: すべてのセッションをクリア
kk: Барлық сессияларды тазарту
pt: Limpar todas as sessões
ru: Очистить все сессии
zh: 清除所有会话

source: Refresh
ar: تحديث
de: Aktualisieren
es: Actualizar
hi: ताज़ा करें
ja: 更新
kk: Жаңарту
pt: Atualizar
ru: Обновить
zh: 刷新

source: Copy path
ar: نسخ المسار
de: Pfad kopieren
es: Copiar ruta
hi: पाथ कॉपी करें
ja: パスをコピー
kk: Жолды көшіру
pt: Copiar caminho
ru: Скопировать путь
zh: 复制路径

source: Open path
ar: فتح المسار
ja: パスを開く
kk: Жолды ашу
pt: Abrir caminho
ru: Открыть путь
zh: 打开路径

source: Load file content
ar: تحميل محتوى الملف
de: Dateiinhalt laden
es: Cargar contenido del archivo
hi: फ़ाइल सामग्री लोड करें
ja: ファイル内容を読み込む
kk: Файл мазмұнын жүктеу
pt: Carregar conteúdo do arquivo
ru: Загрузить содержимое файла
zh: 加载文件内容

source: Choose how to load your file
ar: اختر كيفية تحميل ملفك
de: Wählen Sie aus, wie Sie Ihre Datei laden möchten
es: Elige cómo cargar tu archivo
hi: अपनी फ़ाइल कैसे लोड करें, चुनें
ja: ファイルの読み込み方法を選択
kk: Файлыңызды қалай жүктеу керегін таңдаңыз
pt: Escolha como carregar seu arquivo
ru: Выберите способ загрузки файла
zh: 选择如何加载你的文件

source: Paste content
ar: لصق المحتوى
de: Inhalt einfügen
es: Pegar contenido
hi: सामग्री पेस्ट करें
ja: 内容を貼り付け
kk: Мазмұнды қою
pt: Colar conteúdo
ru: Вставить содержимое
zh: 粘贴内容

# pasteTxtOrJsonHere
source: Copy .txt or .json file content and paste it here
ar: انسخ محتوى ملف .txt أو .json والصقه هنا
de: Kopieren Sie den Inhalt einer .txt- oder .json-Datei und fügen Sie ihn hier ein
es: Copia el contenido de un archivo .txt o .json y pégalo aquí
hi: .txt या .json फ़ाइल की सामग्री कॉपी करें और यहाँ पेस्ट करें
ja: .txt または .json ファイルの内容をコピーしてここに貼り付けてください
kk: .txt немесе .json файлдың мазмұнын көшіріп, осында қойыңыз
pt: Copie o conteúdo de um arquivo .txt ou .json e cole aqui
ru: Скопируйте содержимое файла .txt или .json и вставьте его сюда
zh: 复制 .txt 或 .json 文件内容并粘贴到此处

source: Pick files
ar: اختيار ملفات
de: Dateien auswählen
es: Seleccionar archivos
hi: फ़ाइलें चुनें
ja: ファイルを選択
kk: Файлдарды таңдау
pt: Selecionar arquivos
ru: Выбрать файлы
zh: 选择文件

# selectTxtOrJsonFromDevice
source: Select .txt or .json files from your device
ar: اختر ملفات .txt أو .json من جهازك
de: Wählen Sie .txt- oder .json-Dateien von Ihrem Gerät aus
es: Selecciona archivos .txt o .json desde tu dispositivo
hi: डिवाइस से .txt या .json फ़ाइलें चुनें
ja: デバイスから .txt または .json ファイルを選択
kk: Құрылғыңыздан .txt немесе .json файлдарын таңдаңыз
pt: Selecione arquivos .txt ou .json do seu dispositivo
ru: Выберите файлы .txt или .json с вашего устройства
zh: 从你的设备选择 .txt 或 .json 文件

# onlyTxtAndJsonSupported
source: Only .txt and .json files are supported (max 10MB)
ar: يتم دعم ملفات .txt و .json فقط (الحد الأقصى 10MB)
de: Nur .txt- und .json-Dateien werden unterstützt (max. 10 MB)
es: Solo se admiten archivos .txt y .json (máx. 10 MB)
hi: केवल .txt और .json फ़ाइलें समर्थित हैं (अधिकतम 10MB)
ja: .txt と .json のみ対応（最大 10MB）
kk: Тек .txt және .json файлдары қолдау табады (ең көп 10 МБ)
pt: Apenas arquivos .txt e .json são suportados (máx. 10 MB)
ru: Поддерживаются только файлы .txt и .json (макс. 10 МБ)
zh: 仅支持 .txt 和 .json 文件（最大 10MB）

source: and
ar: و
de: und
es: y
hi: और
ja: と
kk: және
pt: e
ru: и
zh: 和

# onlyExtensionsSupported
source: Only {extensions} files are supported (max {max})
ar: يتم دعم ملفات {extensions} فقط (الحد الأقصى {max})
de: Nur {extensions}-Dateien werden unterstützt (max. {max})
es: Solo se admiten archivos {extensions} (máx. {max})
hi: केवल {extensions} फ़ाइलें समर्थित हैं (अधिकतम {max})
ja: {extensions} ファイルのみ対応（最大 {max}）
kk: Тек {extensions} файлдары қолдау табады (ең көп {max})
pt: Apenas arquivos {extensions} são suportados (máx. {max})
ru: Поддерживаются только файлы {extensions} (макс. {max})
zh: 仅支持 {extensions} 文件（最大 {max}）

source: Cancel
ar: إلغاء
es: Cancelar
hi: रद्द करें
ja: キャンセル
kk: Болдырмау
pt: Cancelar
ru: Отмена
zh: 取消

source: Paste your file content below:
ar: الصق محتوى ملفك أدناه:
es: Pega el contenido de tu archivo a continuación:
hi: अपनी फ़ाइल सामग्री नीचे चिपकाएं:
ja: ファイルの内容を以下に貼り付けてください：
kk: Файл мазмұнын төменде қойыңыз:
pt: Cole o conteúdo do seu arquivo abaixo:
ru: Вставьте содержимое файла ниже:
zh: 请在下方粘贴您的文件内容：

source: Paste your .txt or .json file content here...
ar: الصق محتوى ملف .txt أو .json هنا...
es: Pega el contenido de tu archivo .txt o .json aquí...
hi: अपनी .txt या .json फ़ाइल सामग्री यहाँ चिपकाएं...
ja: .txt または .json ファイルの内容をここに貼り付けてください...
kk: .txt немесе .json файл мазмұнын мұнда қойыңыз...
pt: Cole o conteúdo do seu arquivo .txt ou .json aqui...
ru: Вставьте содержимое .txt или .json файла здесь...
zh: 请在此处粘贴您的 .txt 或 .json 文件内容...

source: Process
ar: معالجة
es: Procesar
hi: प्रोसेस
ja: 処理
kk: Өңдеу
pt: Processar
ru: Обработать
zh: 处理

# confirmClearAllDailySessions
source: Are you sure you want to clear all daily sessions?
ar: هل أنت متأكد من أنك تريد مسح جميع الجلسات اليومية؟
hi: क्या आप वाकई सभी दैनिक सेशन साफ़ करना चाहते हैं?
ja: すべての日次セッションをクリアしてもよろしいですか？
kk: Сіз барлық күнделікті сессияларды тазалағыңыз келетініне сенімдісіз бе?
pt: Tem certeza de que deseja limpar todas as sessões diárias?
ru: Вы уверены, что хотите очистить все ежедневные сессии?
zh: 您确定要清除所有每日会话吗？

source: Daily sessions refreshed
ar: تم تحديث الجلسات اليومية
hi: दैनिक सेशन रीफ्रेश हो गए
ja: 日次セッションが更新されました
kk: Күнделікті сессиялар жаңартылды
pt: Sessões diárias atualizadas
ru: Ежедневные сессии обновлены
zh: 每日会话已刷新

source: Sessions Path Copied
ar: تم نسخ مسار الجلسات
hi: सेशन पाथ कॉपी किया गया
ja: セッションパスがコピーされました
kk: Сессия жолы көшірілді
pt: Caminho das sessões copiado
ru: Путь к сессиям скопирован
zh: 会话路径已复制

source: Error
ar: خطأ
hi: त्रुटि
ja: エラー
kk: Қате
pt: Erro
ru: Ошибка
zh: 错误

source: OK
ar: موافق
hi: ठीक है
kk: Жарайды
ru: ОК
zh: 确定

source: File size
ar: حجم الملف
hi: फ़ाइल साइज़
ja: ファイルサイズ
kk: Файл өлшемі
pt: Tamanho do arquivo
ru: Размер файла
zh: 文件大小

source: Loading
ar: تحميل
hi: लोड हो रहा है
ja: 読み込み中
kk: Жүктеу
pt: Carregando
ru: Загрузка
zh: 加载中

# wsSentLogDesc
source: Message sent through WebSocket connection
ar: سجل رسائل WebSocket المُرسلة
kk: WebSocket жіберілген хабарламалар журналы
pt: Registro de mensagens WebSocket enviadas
ru: Сообщение отправлено через WebSocket соединение
zh: WebSocket 发送消息日志

# wsReceivedLogDesc
source: Message received through WebSocket connection
ar: سجل رسائل WebSocket المستلمة
kk: WebSocket қабылданған хабарламалар журналы
pt: Registro de mensagens WebSocket recebidas
ru: Сообщение получено через WebSocket соединение
zh: WebSocket 接收消息日志

# dbQueryLogDesc
source: Database request executed
ar: سجل استعلامات قاعدة البيانات
kk: Дерекқор сұранымдары журналы
pt: Registro de consultas ao banco de dados
ru: Запрос к базе данных выполнен
zh: 数据库查询日志

# dbResultLogDesc
source: Database returned results
ar: سجل نتائج قاعدة البيانات
kk: Дерекқор нәтижелері журналы
pt: Registro de resultados do banco de dados
ru: База данных вернула результаты
zh: 数据库结果日志

# dbErrorLogDesc
source: Database operation failed
ar: سجل أخطاء قاعدة البيانات
kk: Дерекқор қателері журналы
pt: Registro de erros do banco de dados
ru: Операция с базой данных завершилась ошибкой
zh: 数据库错误日志
